app/views/movies/show.html.erb

<% if user_signed_in? %>
	<% viewer = Viewer.find_by(:user_id => current_user[:id], :movie_id => @movie.id) %>
---
SELECT `viewers`.* FROM `viewers` WHERE `viewers`.`user_id` = 25 AND `viewers`.`movie_id` = 3400 LIMIT 1