app/controllers/authentications_controller.rb

SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`provider` = 'facebook' AND `authentications`.`uid` = '100000071463858' LIMIT 1
INSERT INTO `authentications` (`created_at`, `provider`, `uid`, `updated_at`, `user_id`) VALUES ('2014-01-09 17:50:32', 'facebook', '100000071463858', '2014-01-09 17:50:32', 1)
INSERT INTO `users` (`created_at`, `email`, `updated_at`, `username`) VALUES ('2014-01-10 20:52:48', 'ankit.k1991@gmail.com', '2014-01-10 20:52:48', 'ankit.k1991')
---
  def create
    auth = request.env["omniauth.auth"]
    authentication = Authentication.find_by(:provider => auth['provider'], :uid => auth['uid'])
    if authentication
      sign_in_and_redirect(:user, authentication.user)
    elsif current_user
      current_user.authentications.create(:provider => auth['provider'], :uid => auth['uid'])

SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`id` = 2 LIMIT 1
DELETE FROM `authentications` WHERE `authentications`.`id` = 2
---
  def destroy
    @authentication = current_user.authentications.find(params[:id])
    @authentication.destroy