app/controllers/movies_controller.rb

SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 3400 LIMIT 1
---
	def show
		@movie = Movie.find(params[:id])

SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 9706 LIMIT 1
UPDATE `movies` SET `like` = 1, `dislike` = 1, `updated_at` = '2014-01-11 08:54:11' WHERE `movies`.`id` = 3609
INSERT INTO `viewers` (`created_at`, `like`, `movie_id`, `updated_at`, `user_id`) VALUES ('2014-01-11 08:29:18', 1, 9706, '2014-01-11 08:29:18', 25)
SELECT `viewers`.* FROM `viewers` WHERE `viewers`.`user_id` = 25 AND `viewers`.`movie_id` = 3609 LIMIT 1
DELETE FROM `viewers` WHERE `viewers`.`id` = 9
---
	def index
		movie = Movie.find(params[:movie_id])
		if params[:what] == "like"
			movie.like += 1
			if movie.save
				viewer = Viewer.new
				viewer.movie_id = params[:movie_id]
				viewer.user_id = current_user[:id]
				viewer.like = 1
				viewer.save!
			end
		elsif params[:what] == "dislike"
			movie.dislike += 1
			if movie.save
				viewer = Viewer.new
				viewer.movie_id = params[:movie_id]
				viewer.user_id = current_user[:id]
				viewer.like = 0
				viewer.save!
			end
		elsif params[:what] == "nodislike"
			movie.dislike -= 1
			if movie.save
				viewer = Viewer.find_by(:user_id => current_user[:id], :movie_id => params[:movie_id])
				viewer.destroy

UPDATE `viewers` SET `like` = 0, `updated_at` = '2014-01-11 08:54:11' WHERE `viewers`.`id` = 7
---
			if movie.save
				viewer = Viewer.find_by(:user_id => current_user[:id], :movie_id => params[:movie_id])
				viewer.like = 0
				viewer.save