app/controllers/reviews_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `reviews` (`created_at`, `like`, `movie_id`, `review_text`, `updated_at`, `user_id`) VALUES ('2014-01-10 18:55:02', 0, 7806, 'nice one', '2014-01-10 18:55:02', 3)
---
	def create
		@review = User.find(current_user[:id]).reviews.new(review_params)
		@review.like = 0
  		@review.save