app/views/reviews/_form.html.erb


<% reviews = Review.where(:movie_id => movie_id).order(id: :desc) %>
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`movie_id` = 3400 ORDER BY `reviews`.`id` DESC

								<div class="detail-title">
									<span class="name"><% u = User.find(r.user_id) %><%= u.username || u.email %></span>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 25 ORDER BY `users`.`id` ASC LIMIT 1